In [1]:
import pandas as pd

In [2]:
import sqlite3 as sql

In [3]:
DB = "jobs.db"

In [4]:
conn =  sql.connect("jobs.db")

In [5]:
def run_query(q):
    return pd.read_sql_query(q,conn)

In [6]:
q = """SELECT COUNT(Major) , MIN(Median) 
       FROM recent_grads
       WHERE ShareWomen > 0.5"""
run_query(q)

   COUNT(Major)  MIN(Median)
0            97        22000

In [7]:
q = """SELECT COUNT(Major) as Total_Majors, MIN(Median) as Median , MAX(College_jobs)
       FROM recent_grads
       WHERE ShareWomen > 0.5"""
run_query(q)

   Total_Majors  Median  MAX(College_jobs)
0            97   22000             151643

In [8]:
q = """SELECT COUNT(Major) as Total_Majors, AVG(Median) as Median , MAX(College_jobs)
       FROM recent_grads
       WHERE ShareWomen > 0.5"""
run_query(q)

   Total_Majors        Median  MAX(College_jobs)
0            97  34794.845361             151643

In [9]:
q = """SELECT Major_category  
       FROM recent_grads"""
run_query(q).head()

  Major_category
0    Engineering
1    Engineering
2    Engineering
3    Engineering
4    Engineering

In [10]:
q = """SELECT Major_category  
       FROM recent_grads"""
run_query(q).head()

  Major_category
0    Engineering
1    Engineering
2    Engineering
3    Engineering
4    Engineering

In [11]:
q = """SELECT DISTINCT(Major_category)  
       FROM recent_grads"""
run_query(q).head()                                    # DISTINCT == UNIQUE

            Major_category
0              Engineering
1                 Business
2        Physical Sciences
3      Law & Public Policy
4  Computers & Mathematics

In [12]:
q = """SELECT Major,Major_category, (P75th - P25th) as "percentile range" FROM recent_grads limit 10"""
run_query(q)

,Major,Major_category,percentile range
0,PETROLEUM ENGINEERING,Engineering,30000
1,MINING AND MINERAL ENGINEERING,Engineering,35000
2,METALLURGICAL ENGINEERING,Engineering,55000
3,NAVAL ARCHITECTURE AND MARINE ENGINEERING,Engineering,37000
4,CHEMICAL ENGINEERING,Engineering,25000
5,NUCLEAR ENGINEERING,Engineering,52000
6,ACTUARIAL SCIENCE,Business,19000
7,ASTRONOMY AND ASTROPHYSICS,Physical Sciences,77500
8,MECHANICAL ENGINEERING,Engineering,22000
9,ELECTRICAL ENGINEERING,Engineering,27000